---
kind: method
id: M:Autodesk.Revit.DB.FilteredElementCollector.GetEnumerator
zh: 筛选、过滤
source: html/746ac65b-35c2-d0db-53d7-4fe0fd61ab1f.htm
---
# Autodesk.Revit.DB.FilteredElementCollector.GetEnumerator Method

**中文**: 筛选、过滤

Returns an enumerator that iterates through a collection.

## Syntax (C#)
```csharp
public virtual IEnumerator<Element> GetEnumerator()
```

## Returns
An IEnumerator object that can be used to iterate through the collection.